{
    "version": "https://jsonfeed.org/version/1",
    "title": "PrivacyNow",
    "description": "",
    "home_page_url": "https://privacynow.eu.org",
    "feed_url": "https://privacynow.eu.org/feed.json",
    "user_comment": "",
    "author": {
        "name": "Albert Arnaud"
    },
    "items": [
        {
            "id": "https://privacynow.eu.org/why-does-tls-matter.html",
            "url": "https://privacynow.eu.org/why-does-tls-matter.html",
            "title": "Why does TLS matter?",
            "summary": " When browsing the internet or using a website, you should always&hellip;",
            "content_html": "<div class=\"post-inner thin \">\n<div class=\"entry-content\">\n<p>When browsing the internet or using a website, you should always make sure that your connection to the website is encrypted via TLS, mostly referred to as HTTPS, so no one can see exactly what you’re doing.</p>\n<p>TLS stands for Transport Layer Security, but we find that it’s mostly referred to as transport encryption. HTTP stands for Hypertext Transfer Protocol, and is displayed in all website URLs before the domain name. For example, <strong>http</strong>://duckduckgo.com. When transport encryption is being utilized, <strong>https://</strong> is displayed before a website domain name rather than <strong>http://</strong> The <strong>S</strong> simply stands for secure, because your connection to the website is now secure as it is encrypted.</p>\n<p>When you’re not utilizing TLS aka HTTPS when connected to a website, all information/data that you send and receive from that website is transmitted in plaintext. This means hackers, an everyday citizen that knows a bit about cybersecurity, your ISP, and more, can all easily see all of the information you are sending and receiving, all in plaintext. This means they can see your username(s), password(s), credit card details (depending on the unencrypted website which you are using), and much more.</p>\n<p>When you are utiziling TLS aka HTTPS - your connection to x website, as mentioned, is encrypted. This means hackers and your ISP, when inspecting web traffic, will just see a bunch of random gibberish (random letters, numbers, symbols, etc) rather than your information/data in plaintext. As the name suggests, transport encryption ensures that your data when leaving your network is encrypted and remains encrypted while in transport, and is then decrypted at the destination website or service.</p>\n<p>Fortunately nowadays, many browsers attempt to force an encrypted connection to websites when possible, but not all browsers do this, and not all websites support TLS. If a website you are visiting/using does not support TLS (indicated by whether or not the lock icon in your browser is green), you should not be using that website as it is considered to be dangerous. HTTPS Everywhere is a browser addon created by EFF (Electronic Frontier Foundation) that ensures you are always connected to websites using HTTPS aka TLS, if your browser does not enforce HTTPS connections. Please note that EFF is planning on deprecating the HTTPS Everywhere browser addon some time in 2022 as more and more browsers are beginning to enforce HTTPS connections.</p>\n<p>Thanks for reading!</p>\n</div>\n</div>",
            "image": "https://privacynow.eu.org/media/posts/5/https.png",
            "author": {
                "name": "Albert Arnaud"
            },
            "tags": [
            ],
            "date_published": "2021-12-31T08:52:00-05:00",
            "date_modified": "2022-01-09T23:52:59-05:00"
        },
        {
            "id": "https://privacynow.eu.org/self-hosting-a-vpn.html",
            "url": "https://privacynow.eu.org/self-hosting-a-vpn.html",
            "title": "Self Hosting a VPN",
            "summary": " Choosing a VPN provider can be difficult at times, especially if&hellip;",
            "content_html": "<div class=\"post-inner thin \">\n<div class=\"entry-content\">\n<p>Choosing a VPN provider can be difficult at times, especially if you are on a budget or are still concerned about whether or not the VPN logs your activity or not. Fortunately, open source software allows you to host your own VPN server on a machine. Please only follow this simple guide if you have a decent amount of Linux knowledge and know what you’re doing, otherwise very bad things could happen and you’d be better off using a 3rd party privacy-respecting VPN provider like Mullvad.</p>\n<p>We will be using the WireGuard software for this demonstration. WireGuard® is an extremely simple yet fast and modern VPN that utilizes state-of-the-art cryptography. It aims to be faster, simpler, leaner, and more useful than IPsec, while avoiding the massive headache. It intends to be considerably more performant than OpenVPN. WireGuard is designed as a general purpose VPN for running on embedded interfaces and super computers alike, fit for many different circumstances. Initially released for the Linux kernel, it is now cross-platform (Windows, macOS, BSD, iOS, Android) and widely deployable. It is currently under heavy development, but already it might be regarded as the most secure, easiest to use, and simplest VPN solution in the industry. (credit: wireguard.com)</p>\n<p>WireGuard supports Ubuntu, Debian, Fedora, and more, but we’ll be using Ubuntu for the WireGuard VPN Server. First, you will need to choose a trustworthy, secure, and privacy-respecting VPS provider to host this VPN on. We’ll save you some time so you don’t need to go looking for one of those, we have multiple privacy-respecting, secure, and trustworthy VPS providers listed here -&gt; <a href=\"https://swivro.net/hosting-providers.html\">https://swivro.net/hosting-providers.html</a></p>\n<p>Once you purchase your VPS, you’ll want to select Ubuntu 20.04 LTS (or Debian &gt;= 10) as the Operating System. After the Operating System has been installed, you should be provided with SSH credentials so you can access your server. We suggest using PuTTY as an SSH Client as it is free and open source. Now that you’re logged in to SSH, if you’re not logged in as root, you should type <code>sudo su</code> and click enter. To easily install WireGuard, we’ll be using a 3rd party script called wire-guard install which is open source and is available on GitHub. Begin the installation process by copy and pasting the following 3 commands.</p>\n<pre tabindex=\"0\"><code>curl -O https://raw.githubusercontent.com/angristan/wireguard-install/master/wireguard-install.sh\nchmod +x wireguard-install.sh\n./wireguard-install.sh\n</code></pre>\n<p>After entering that last command, you will be prompted with some questions. Click enter on all of them (unless you want to change something) to select all of the default options.</p>\n<p>A private key file should have now been saved, and a QR code should be displayed. Take that private key and import it to your WireGuard client and voilà. If you have WireGuard on mobile (Android/iOS), you can scan the QR code that is displayed in your SSH session, using your WireGuard app and your phone camera. You now have your own self-hosted VPN.</p>\n<p>Thanks for reading!</p>\n</div>\n</div>",
            "image": "https://privacynow.eu.org/media/posts/4/cyber-security-3400657_1920.jpg",
            "author": {
                "name": "Albert Arnaud"
            },
            "tags": [
            ],
            "date_published": "2021-12-20T23:59:00-05:00",
            "date_modified": "2022-01-09T23:51:57-05:00"
        },
        {
            "id": "https://privacynow.eu.org/what-is-threat-modeling.html",
            "url": "https://privacynow.eu.org/what-is-threat-modeling.html",
            "title": "What is Threat Modeling?",
            "summary": " Threat modeling is a very important thing when attempting to restore&hellip;",
            "content_html": "<div class=\"post-inner thin \">\n<div class=\"entry-content\">\n<p>Threat modeling is a very important thing when attempting to restore your online privacy. Essentially, a threat model is a list of the most probable &amp; significant threats to your online privacy &amp; security. Online Privacy means different things to different people, which is why you should create your own threat model before taking any actions to protect your privacy. A threat model helps you determine what software, providers, and tools you should use to retain your online privacy. You can start building your threat model simply by answering the following two questions:</p>\n<ul>\n<li>What do I want to protect?</li>\n<li>Who do I want to protect it from?</li>\n</ul>\n<p>Once you have answered those two basic questions, you have yourself a simple yet telling threat model. The average citizen’s threat model might be (protecting their online data from) tech giants like Google, Apple, Microsoft, etc. Other people have different threat models. For example, Edward Snowden’s (the whistleblower) threat model might be (protecting himself from) a foreign government. What online privacy means to you depends on your threat model. Now that you have created a threat model for yourself, you can get started with restoring your online privacy. Check out swivro.net to explore a directory of privacy-respecting software and internet providers.</p>\n<p>Thanks for reading!</p>\n</div>\n</div>",
            "image": "https://privacynow.eu.org/media/posts/3/lock1.png",
            "author": {
                "name": "Albert Arnaud"
            },
            "tags": [
            ],
            "date_published": "2021-12-19T23:58:00-05:00",
            "date_modified": "2022-01-09T23:50:17-05:00"
        },
        {
            "id": "https://privacynow.eu.org/comcast-sucks.html",
            "url": "https://privacynow.eu.org/comcast-sucks.html",
            "title": "Comcast Sucks",
            "summary": " Comcast is an American internet service provider which received a 1-star&hellip;",
            "content_html": "<div class=\"post-inner thin \">\n<div class=\"entry-content\">\n<p>Comcast is an American internet service provider which received a 1-star privacy rating from the Electronic Frontier Foundation back in 2017. Here are some factors to take into account when considering using Comcast as your internet service provider (source: EFF.org):</p>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>✅ Follows industry-wide basic privacy practices</ul>\n</li>\n</ul>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>❌ Tells users about government data requests</ul>\n</li>\n</ul>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>❌ Promises not to sell the data of its users</ul>\n</li>\n</ul>\n<ul>         ❌ Stands up to government gag orders</ul>\n<p>Comcast does claim that they do not spy on their users. <i>Ironically</i>, they fought against Google Chrome &amp; Mozilla Firefox’s new encrypted-DNS feature which encrypts DNS traffic that leaves the browser, making it harder for Comcast (or other ISPs) to monitor and tamper with their customers' internet traffic. Why in the world would they fight against this privacy-enhancing feature if they don’t spy on their users?</p>\n<p>Moreover, in the year 2015, a Comcast customer named Lisa Brown had contacted Comcast’s customer service via telephone, requesting for Comcast to downgrade her Comcast service in order to lower the cost of her monthly payment. Comcast, instead of downgrading her service, offered her a service upgrade without extra charge. Lisa refused the offer, as expected, because she clearly stated that she wants her service to be downgraded. Lisa noticed that on the next monthly bill/invoice sent to her, the customer service rep she had contacted had changed her name in the Comcast system from Lisa Brown to “Asshole Brown”. This is a truly horrible company. A similar situation occurred in the year of 2014, where a journalist named Ryan Block called up Comcast to cancel his service. Comcast straight up refused to cancel his service even after 20 minutes of arguing.</p>\n<p>Comcast is a company that solely cares about making money, doesn’t care one bit about user privacy or service quality, and has god awful and extremely rude customer support. Please avoid this company at all costs.</p>\n</div>\n</div>",
            "image": "https://privacynow.eu.org/media/posts/2/comcast.png",
            "author": {
                "name": "Albert Arnaud"
            },
            "tags": [
            ],
            "date_published": "2021-12-19T23:47:00-05:00",
            "date_modified": "2022-01-09T23:48:20-05:00"
        },
        {
            "id": "https://privacynow.eu.org/the-google-pixels-ironically-good-privacy.html",
            "url": "https://privacynow.eu.org/the-google-pixels-ironically-good-privacy.html",
            "title": "The Google Pixel&#x27;s Ironically Good Privacy",
            "summary": " The Google Pixel Smartphone ironically has surprisingly good user privacy. We&hellip;",
            "content_html": "\n  <p>\n    <br>The Google Pixel Smartphone ironically has surprisingly good user privacy. We say ironically, because the Google Pixel is developed by Google, and Google is known to not respect user privacy, but that may not be the case with the Google Pixel. I, the author of this post, am definitely a huge advocate for online privacy, but my next smartphone may be a Google Pixel.\n<br>\n<br>The Pixel uses Android, the same operating system that Samsung, Moto, OnePlus, LG, and many more all use for their smartphones. Android is open source and is primarily maintained by Google at this time. Because Android is primarily maintained and developed by Google right now, it includes many Google Services by default. This includes Google Play, YouTube, and other hidden Google Applications. This means that you are being tracked by Google on your smartphone. Smartphone companies like Samsung, OnePlus, and more, which all use Android, add their own tracking software on top of Google’s.\n<br>\n<br>With the Google Pixel, you’re simply just locked to Google Tracking. The Pixel also allows you to disable all Google Services and Apps in the phone’s settings app. The Pixel also has very many privacy-enhancing features such as MAC Address randomization and more. It is very ironic, seeing that this is all Google. As for iOS and iPhones, we are not a fan of what they are doing with their new child-abuse scanning garbage, and therefore, we no longer recommend Apple products. Please do note that by purchasing a Google Pixel, you are directly supporting Google by paying them, and you can never be 100% private or 100% secure, but the Pixel is a step in the right direction for Google.&nbsp;<br>\n  </p>",
            "image": "https://privacynow.eu.org/media/posts/1/gpixel.png",
            "author": {
                "name": "Albert Arnaud"
            },
            "tags": [
            ],
            "date_published": "2021-12-18T23:46:00-05:00",
            "date_modified": "2022-01-09T23:47:09-05:00"
        }
    ]
}
